###################################################################

# Created by write_sdc on Sun Dec 1 17:54:08 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock [get_ports clk]  -period 10  -waveform {0 5}
